tutorials/floatRigidBody/trial_cases/floatRigidBody_monolithic/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Floating box: 0.1 x 0.05 (full tank width) x 0.05 m, centre (0.5 0.025 0.15).
// c0 is everything except the box; subsetMesh keeps c0 and puts the exposed
// faces in the floatingObject patch.

actions
(
    {
        name    c0;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (0.45 -1 0.125) (0.55 1 0.175);
    }
    {
        name    c0;
        type    cellSet;
        action  invert;
    }
);

// ************************************************************************* //
